CFD_static_LES/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];


boundaryField
{
	
    
    inlet
    {
        type            zeroGradient;
    }

    outlet 
    {
        type            zeroGradient;
    }
    sides
    {
        type            zeroGradient;
    }
    
    
    train
    {
        type            zeroGradient;
    }
    outside
    {
	type            zeroGradient;
    }

    AMI1
    {
        type            cyclicACMI;
        value           uniform 0;
    }

    AMI2
    {
        type            cyclicACMI;
        value           uniform 0;
    }
    #include "include/frontBackPatches"




}


// ************************************************************************* //
