CFD_static_LES/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet 
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet 
    {
        type            fixedValue;
        value           $internalField;
    }
    trains 
    {
        type            zeroGradient;
    }

    outside
    {
        type            zeroGradient;
    }


    AMI1
    {
        type            cyclicACMI;
        value           $internalField;
    }

    AMI2
    {
        type            cyclicACMI;
        value           $internalField;
    }

    #include "include/frontBackPatches"


}

// ************************************************************************* //
